# GridNode Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
GridNode Constructor
GridNode Structure See Also
---
Initializes a new instance of the GridNode class
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public GridNode(
	int uIndex,
	int vIndex
)
```

Visual Basic
---
```text
Public Sub New ( _
	uIndex As Integer, _
	vIndex As Integer _
)
```

Visual C++
---
```text
public:
GridNode(
	int uIndex,
	int vIndex
)
```

# ### Parameters
uIndex
    Type: System..::..Int32
vIndex
    Type: System..::..Int32
# See Also
GridNode Structure
Autodesk.Revit.DB Namespace